Tekla.Structures.Model.Events.ModelObjectNumberedDelegate
The delegate to use for model objects which are numbered.
ModelObjects contain only identifier information. If properties need to be checked, Select() for object is required.